// 1. Запросить у пользователя его возраст и определить, кем он
// является: ребенком (0–2), подростком (12–18), взрослым
// (18_60) или пенсионером (60– ...).

// const years_old = prompt("Сколько вам лет?")
// if (years_old <= 2) alert('Вы явлеетесь: ребенком');
// if (years_old <= 18 && years_old >= 12) alert('Вы явлеетесь: подростком');
// if (years_old <= 59 && years_old >= 19) alert('Вы явлеетесь: взрослым');
// if (years_old >= 60) alert('Вы явлеетесь: пенсионером');




// 2. Запросить у пользователя число от 0 до 9 и вывести ему
// спецсимвол, который расположен на этой клавише (1–!,
// 2–@, 3–# и т. д).

// const number_symbol = prompt("Введите цифру от 0 до 9")

// switch (number_symbol) {
//     case "0":
//         alert("0 - )"); break;
//     case "1":
//         alert("1 - !"); break;
//     case "2":
//         alert("2 - @"); break;
//     case "3":
//         alert("3 - #"); break;
//     case "4":
//         alert("4 - $"); break;
//     case "5":
//         alert("5 - %"); break;
//     case "6":
//         alert("6 - ^"); break;
//     case "7":
//         alert("7 - &"); break;
//     case "8":
//         alert("8 - *"); break;
//     case "9":
//         alert("9 - ("); break;
// }

// 3. Запросить у пользователя трехзначное число и проверить,
// есть ли в нем одинаковые цифры.

// const number = prompt('Введите трехзначное число:');
// if (number[0] == number[1] || number[0] == number[2] || number[1] == number[2]) {
//     alert('Есть совпадения');
// }
// else
//     alert('Нету совпадений');



// 4. Запросить у пользователя год и проверить, високосный он
// или нет. Високосный год либо кратен 400, либо кратен 4 и
// при этом не кратен 100.

// сonst year = prompt('Введите ваш год рождения');
//     if (year%4 == 0 && year %100 !== 0)
//     {
//         alert('Высокосный год');
//     }
//     else
//         alert('Не высокосный год');



// 5. Запросить у пользователя пятиразрядное число и определить, является ли оно палиндромом

// const number = prompt('Введите пятикратное число:');
// if (number[0] == number[4] && number[1] == number[3]) {
//     alert('Палиндромное число');
// }
// else
//     alert('Не палиндромное число');

// ----------------------------------------------------------------------------------------
